Revit 2015 API
BuiltInFailures.MEPFabricationFailures Members
Provides a container of all Revit built-in FailureDefinitionId instances.
The BuiltInFailures.MEPFabricationFailures type exposes the following members.
Properties
Name | Description
CannotConvertFlexPipeToPart
 Cannot convert flex pipe to fabrication part.
SizeNotAvailableInFabricationService
 Sizes:%1!s! in system %2!s! are not available in fabrication service:%3!s!, All available sizes are:\n%4!s!.
See Also
BuiltInFailures.MEPFabricationFailures Class
Autodesk.Revit.DB Namespace